#pragma once

static const char * VERSION_APPLICATION = "1.1.0";

/*
 * ---------------------------------------------------------------------------------------------------------------------
 * Version: 1.1.0 (10 Sep 2019)
 * ---------------------------------------------------------------------------------------------------------------------
 * Рефакторинг кода библиотеки
 */

/*
 * ---------------------------------------------------------------------------------------------------------------------
 * Version: 1.0.1 (4 Sep 2019)
 * ---------------------------------------------------------------------------------------------------------------------
 * При превышения входного и выходного буфера возвращается 413 код
 * Возможность установки размеров входных и выходных буферов из кода
 */

/*
 * ---------------------------------------------------------------------------------------------------------------------
 * Version: 1.0.0 (3 Sep 2019)
 * ---------------------------------------------------------------------------------------------------------------------
 * Поддержка HTTP Range Requests
 * Поддержка сжатия gzip
 * Кеширование статических ресурсов
 * Поддержка запросов GET, POST, PUT, DELETE, HEAD
 * Поддержка многопоточной работы сервера
 * Поддержка логирования
 * Поддержка запросов application/x-www-form-urlencoded
 * Поддержка запросов multipart/form-data
 * Ограничение времени запроса на сервере и поиск зависших сокетов
 * Поддержка Keep-Alive соединений
 * Возможность управление настройкой сервера через конфигурационный файл
 * Страница статистики сервера
 */